<a href="https://colab.research.google.com/github/AteneaCB/Python/blob/main/Sesi%C3%B3n4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Sesión 4. Pandas y Análisis Exploratorio de Datos**

In [3]:
#Paquete pandas "panel data"

import pandas as pd 

#Serie, secuencia ordenada
serie_1 = pd.Series([2,4,6,8,10,12])

In [4]:
#Se muestran los índices en la izquierda, pueden ser números consecutivos o no, por ejemplo letras o no consecutivos
#Con dtype muestra la forma más optimizada para trabajar
serie_1

0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

In [6]:
#Para indicar el índice para la serie
series_2 = pd.Series([4,5,6,7], index=[10, 11, 12,13])
series_2

10    4
11    5
12    6
13    7
dtype: int64

In [7]:
#Índices con letras
series_3 = pd.Series([9,8,6,4], index=['a', 'b', 'c', 'd'])
series_3

a    9
b    8
c    6
d    4
dtype: int64

In [8]:
#Índices con directorio
series_4 = pd.Series({
    'Atenea': 34,
    'Alberto': 35,
    'Maria': 12,
    'Ana': 25
})
series_4

Atenea     34
Alberto    35
Maria      12
Ana        25
dtype: int64

In [11]:
#Con loc acceder a los ídices
series_3.loc['c']

6

In [12]:
#Se pueden utilizar comillas simples o dobles para acceder a las llaves o elementos
series_4.loc["Atenea"]

34

**Reto 1.** Series

**a) Creación de series**

A continuación tenemos unas variables que contienen los nombres de los ejecutivos más importantes de nuestra ya conocida EyePoker Inc. Hay una variable que no ha sido asignada aún: sueldos =
Tu tarea es crear una Serie de pandas y asignarla a la variable sueldos. La información que hay dentro de esta variable son (oh, sorpresa) los sueldos de dichos ejecutivos.
Los valores de la Serie serán los sueldos, mientras que el índice de la Serie serán los nombres de los ejecutivos.

In [16]:
#Ejecutivos y sueldos
ejecutivo_1 = 'Marco P.'
ejecutivo_2 = 'Jenny'
ejecutivo_3 = 'Britney Baby'
ejecutivo_4 = 'Pepe Guardabosques'
ejecutivo_5 = 'Lombardo El Destructor'

sueldos = pd.Series({
    ejecutivo_1: 55000,
    ejecutivo_2: 85000,
    ejecutivo_3: 125000,
    ejecutivo_4: 40000,
    ejecutivo_5: 76000
})

sueldos

Marco P.                   55000
Jenny                      85000
Britney Baby              125000
Pepe Guardabosques         40000
Lombardo El Destructor     76000
dtype: int64

In [17]:
#Imprimir
print('== Sueldos de los principales ejecutivos de EyePoker Inc. ==\n')

print(f'{("Ejecutivo"):25} | {("Sueldo")}')
print('----------------------------------------')
print(f'{ejecutivo_1:25} | ${(sueldos.loc[ejecutivo_1])} MXN')
print(f'{ejecutivo_2:25} | ${(sueldos.loc[ejecutivo_2])} MXN')
print(f'{ejecutivo_3:25} | ${(sueldos.loc[ejecutivo_3])} MXN')
print(f'{ejecutivo_4:25} | ${(sueldos.loc[ejecutivo_4])} MXN')
print(f'{ejecutivo_5:25} | ${(sueldos.loc[ejecutivo_5])} MXN')

== Sueldos de los principales ejecutivos de EyePoker Inc. ==

Ejecutivo                 | Sueldo
----------------------------------------
Marco P.                  | $55000 MXN
Jenny                     | $85000 MXN
Britney Baby              | $125000 MXN
Pepe Guardabosques        | $40000 MXN
Lombardo El Destructor    | $76000 MXN

**Ejemplo 3**
Indexación de Series

In [19]:
serie = pd.Series(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'])
serie

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [25]:
#Del primer al quinto elemento
serie.iloc[:5]

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [26]:
#Sólo elementos de interés
serie.iloc[[4, 5,3]]

4    e
5    f
3    d
dtype: object

In [30]:
serie_2 = pd.Series([1,2,3,4,5,6,7,8,9], index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'])
serie_2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [29]:
#Con loc es para índices de letras
#Con iloc es para utilizar índices de números solamente
serie_2.loc['c':'f']

c    3
d    4
e    5
f    6
dtype: int64

**Reto 2**
Indexación de Series

**a) Indexación de series**

Tenemos una Serie que contiene los gastos mensuales totales (en MXN) de distintas divisiones de EyePoker Inc. Tú eres el Contador Oficial y tienes que obtener subconjuntos de datos que sirvan para agregar los gastos totales de diferentes combinaciones de divisiones.

In [31]:
gastos_mensuales = {
    'A': 15000,
    'B': 200000,
    'C': 3250000,
    'D': 120000,
    'E': 135000,
    'F': 55000,
    'G': 100000,
    'H': 25000
}

gastos_serie = pd.Series(gastos_mensuales)

gastos_serie

A      15000
B     200000
C    3250000
D     120000
E     135000
F      55000
G     100000
H      25000
dtype: int64

In [34]:
#El índice es el nombre de la división y los valores son los gastos mensuales en MXN.
#Indexando la serie gastos_serie extrae las combinaciones de divisiones que se indican debajo para poder hacer los cálculos necesarios.

# Los gastos de la división 'D' y 'G'
gastos_D_G = gastos_serie.loc['D','G']

# Los gastos de la división 'A' y 'E'
gastos_A_E = gastos_serie.loc['A','E']

# Los gastos de la división 'B', 'F' y 'H'
gastos_B_F_H = gastos_serie.loc['B', 'F', 'H']

# Los gastos desde la primera división hasta la división 'E'
#gastos_principio_a_E =

# Los gastos desde la división 'D' hasta la 'G'
#gastos_D_a_G =

# Los gastos desde la división 'C' hasta el la última división
#gastos_C_a_final =

1.2

In [ ]:
#Indexación
def revisar_indexaciones(gastos_serie, gastos_D_G, gastos_A_E, gastos_B_F_H,
                         gastos_principio_a_E, gastos_D_a_G, gastos_C_a_final):
    
    print(f'== Revisión de Indexaciones ==\n')
    print(f"{'Indexación':30} | {'Resultado':15} | {'Suma esperada ':15} | {'Suma recibida ':15}")
    print("-"*85)
    revisar_indexacion(gastos_serie.loc[['D', 'G']], gastos_D_G, 'División D y G')
    revisar_indexacion(gastos_serie.loc[['A', 'E']], gastos_A_E, 'División A y E')
    revisar_indexacion(gastos_serie.loc[['B', 'F', 'H']], gastos_B_F_H, 'División B, F y H')
    revisar_indexacion(gastos_serie.loc[:'E'], gastos_principio_a_E, 'Desde primera División a E')
    revisar_indexacion(gastos_serie.loc['D':'G'], gastos_D_a_G, 'División D y G')
    revisar_indexacion(gastos_serie.loc['C':], gastos_C_a_final, 'División C a última División')

def formatear_precio(precio):
    return f"${precio} MXN"
    
def revisar_indexacion(esperada, recibida, nombre):
    es_correcta = 'Correcta' if esperada.equals(recibida) else 'Incorrecta'
    suma_esperada = formatear_precio(sum(esperada))
    suma_recibida = formatear_precio(sum(recibida))
    print(f"{nombre:30} | {es_correcta:15} | {suma_esperada:15} | {suma_recibida:15}")

**Ejemplo 4**
DataFrames

In [35]:
#Formato de DataFrame, tabla
datos = {
    'columna_1': ['valor_fila_0', 'valor_fila_1', 'valor_fila_2', 'valor_fila_3', 'valor_fila_4'],
    'columna_2': ['valor_fila_0', 'valor_fila_1', 'valor_fila_2', 'valor_fila_3', 'valor_fila_4'],
    'columna_3': ['valor_fila_0', 'valor_fila_1', 'valor_fila_2', 'valor_fila_3', 'valor_fila_4'],
    'columna_4': ['valor_fila_0', 'valor_fila_1', 'valor_fila_2', 'valor_fila_3', 'valor_fila_4']
}

df = pd.DataFrame(datos)

df

      columna_1     columna_2     columna_3     columna_4
0  valor_fila_0  valor_fila_0  valor_fila_0  valor_fila_0
1  valor_fila_1  valor_fila_1  valor_fila_1  valor_fila_1
2  valor_fila_2  valor_fila_2  valor_fila_2  valor_fila_2
3  valor_fila_3  valor_fila_3  valor_fila_3  valor_fila_3
4  valor_fila_4  valor_fila_4  valor_fila_4  valor_fila_4

In [36]:
#Para indicar el índice (renglón) del df
df = pd.DataFrame(datos, index=['a','b','c','d','e'])
df

      columna_1     columna_2     columna_3     columna_4
a  valor_fila_0  valor_fila_0  valor_fila_0  valor_fila_0
b  valor_fila_1  valor_fila_1  valor_fila_1  valor_fila_1
c  valor_fila_2  valor_fila_2  valor_fila_2  valor_fila_2
d  valor_fila_3  valor_fila_3  valor_fila_3  valor_fila_3
e  valor_fila_4  valor_fila_4  valor_fila_4  valor_fila_4

In [37]:
#Para acceder elementos de las columnas
df['columna_1']

a    valor_fila_0
b    valor_fila_1
c    valor_fila_2
d    valor_fila_3
e    valor_fila_4
Name: columna_1, dtype: object

In [42]:
#Para acceder a un elemento en particular
df['columna_1']['a']

'valor_fila_0'

In [43]:
#Es igual a llamar primero el índice con loc
df.loc['a', 'columna_1']

'valor_fila_0'

In [39]:
#Acceder a la fila o índice
df.loc['a']

columna_1    valor_fila_0
columna_2    valor_fila_0
columna_3    valor_fila_0
columna_4    valor_fila_0
Name: a, dtype: object

**Reto 3**
Data Frames

- Aprender a crear `DataFrames` e indexar por columna y por fila

a) Creación e indexación de DataFrames

Eres el Data Wrangler (procesador de datos) de EyePoker Inc. Tienes el siguiente diccionario con datos que se refieren a diferentes productos que vende la empresa. Este es tu conjunto de datos y el índice que le corresponde:
1. Convertir en DataFrame
2. Indexar
3. Verificar

In [45]:
datos_productos = {
    "nombre": ["Pokemaster", "Cegatron", "Pikame Mucho", "Lazarillo de Tormes", "Stevie Wonder", "Needle", "El AyMeDuele"],
    "precio": [10000, 5500, 3500, 750, 15500, 12250, 23000],
    "peso": [1.2, 1.5, 2.3, 5.5, 3.4, 2.4, 8.8],
    "capacidad de destrucción retinal": [3, 7, 6, 8, 9, 2, 10],
    "disponible": [True, False, True, True, False, False, True]
}

indice = [1, 2, 3, 4, 5, 6, 7]

In [57]:
#1. DataFrame
df_productos = pd.DataFrame(datos_productos)
df_productos

                nombre  precio  ...  capacidad de destrucción retinal  disponible
0           Pokemaster   10000  ...                                 3        True
1             Cegatron    5500  ...                                 7       False
2         Pikame Mucho    3500  ...                                 6        True
3  Lazarillo de Tormes     750  ...                                 8        True
4        Stevie Wonder   15500  ...                                 9       False
5               Needle   12250  ...                                 2       False
6         El AyMeDuele   23000  ...                                10        True

[7 rows x 5 columns]

In [58]:
#1.1 Cambiar índices
df_productos = pd.DataFrame(datos_productos, index=[1, 2, 3, 4, 5, 6, 7])
df_productos

                nombre  precio  ...  capacidad de destrucción retinal  disponible
1           Pokemaster   10000  ...                                 3        True
2             Cegatron    5500  ...                                 7       False
3         Pikame Mucho    3500  ...                                 6        True
4  Lazarillo de Tormes     750  ...                                 8        True
5        Stevie Wonder   15500  ...                                 9       False
6               Needle   12250  ...                                 2       False
7         El AyMeDuele   23000  ...                                10        True

[7 rows x 5 columns]

In [67]:
#2. Indexaciones

# Quiero un DataFrame que contenga los productos "Pikame Mucho" y "Stevie Wonder"
pm_sw = df_productos.iloc[[3,5]]
pm_sw
# Quiero un DataFrame que contenga desde el producto #4 hasta el último
p4_final = df_productos.iloc[4:]
p4_final
# Quiero un DataFrame que contenga los productos "El AyMeDuele", "Lazarillo de Tormes" y "Needle"
amd_lt_n = df_productos.loc[[7, 4, 3]]
amd_lt_n
# Quiero un DataFrame que contenga desde el primer producto hasta el producto #5
primer_p5 = df_productos.iloc[:5]
primer_p5
# Quiero un DataFrame que contenga los productos "Pikame Mucho" y "Lazarillo de Tormes", pero sólo con las columnas "nombre", "precio" y "peso"
pm_lt_pp = df_productos.loc[[3,4], ['nombre', 'precio', 'peso']]
pm_lt_pp
# Quiero un DataFrame que contenga todos los productos pero con sólo las columnas 'nombre', 'precio' y 'capacidad de destrucción retinal'
t_pcdr = df_productos[['nombre', 'precio', 'capacidad de destrucción retinal']]
t_pcdr
# Quiero un DataFrame que contenga desde el producto #3 hasta el #6, pero sólo las columnas 'nombre', 'precio' y 'disponible'
p3_p6_pd = df_productos.loc[3:6, ['nombre', 'precio', 'disponible']]
p3_p6_pd

                nombre  precio  disponible
3         Pikame Mucho    3500        True
4  Lazarillo de Tormes     750        True
5        Stevie Wonder   15500       False
6               Needle   12250       False

In [71]:
# También se puede hacer filtro para obtener un valor en específico
df_productos.loc[df_productos.loc[:, 'nombre'] == 'Pikame Mucho']
#Un isisn o lista por cada elemento, es menos eficiente con muchos datos
#df[df['nombre'].isin(['Pikame Mucho', 'Stivie Wonder'])]

         nombre  precio  peso  capacidad de destrucción retinal  disponible
3  Pikame Mucho    3500   2.3                                 6        True

In [72]:
#3. Verificar

def verificar_indexaciones(datos_productos, indice, df_productos, pm_sw, p4_final, amd_lt_n, primer_p5, pm_lt_pp, t_pcdr, p3_p6_pd):
    
    import pandas as pd
    
    df_productos_esperado = pd.DataFrame(datos_productos, index=indice)
    if not df_productos_esperado.equals(df_productos):
        print(f'df_productos ha sido creado incorrectamente ... Favor de revisar')
        return
    
    print(f'== Verificación de Indexaciones ==\n')
    verificar_indexacion(df_productos.loc[[3, 5]], pm_sw, 'DataFrame que contenga los productos "Pikame Mucho" y "Stevie Wonder"')
    verificar_indexacion(df_productos.loc[4:], p4_final, 'DataFrame que contenga desde el producto #4 hasta el último')
    verificar_indexacion(df_productos.loc[[7, 4, 6]], amd_lt_n, 'DataFrame que contenga los productos "El AyMeDuele", "Lazarillo de Tormes" y "Needle"')
    verificar_indexacion(df_productos.loc[:5], primer_p5, 'DataFrame que contenga desde el primer producto hasta el producto #5')
    verificar_indexacion(df_productos.loc[[3, 4], ['nombre', 'precio', 'peso']], pm_lt_pp, 'DataFrame que contenga los productos "Pikame Mucho" y "Lazarillo de Tormes", pero sólo con las columnas "nombre", "precio" y "peso"')
    verificar_indexacion(df_productos[['nombre', 'precio', 'capacidad de destrucción retinal']], t_pcdr, "DataFrame que contenga todos los productos pero con sólo las columnas 'nombre', 'precio' y 'capacidad de destrucción retinal'")
    verificar_indexacion(df_productos.loc[3:6, ['nombre', 'precio', 'disponible']], p3_p6_pd, "DataFrame que contenga desde el producto #3 hasta el #6, pero sólo las columnas 'nombre', 'precio' y 'disponible'")
    
def verificar_indexacion(esperada, recibida, descripcion):
    es_correcta = "Correcto" if esperada.equals(recibida) else "Incorrecto"
    respuesta = "Muchas gracias!" if es_correcta == "Correcto" else "Favor de revisar"
    print(f"\n- Descripción de pedido: {descripcion}")
    print(f"El pedido es {es_correcta} ... {respuesta}")

**Ejemplo 5**

Manipulación de datos
- Aprender a crear nuevas columnas en un `DataFrame`
- Aprender a reasignar columnas
- Aprender a eliminar columnas

In [97]:
datos = {
    "Nombre":["Atenea", "Alberto", "Mary", "Barbara", "Selene"],
    "Cereal Favorito": ["avena", "fitness", "honey","corn pops", "cinnamon"]
}

In [98]:
df = pd.DataFrame(datos)
df

    Nombre Cereal Favorito
0   Atenea           avena
1  Alberto         fitness
2     Mary           honey
3  Barbara       corn pops
4   Selene        cinnamon

In [99]:
#Para ver los primeros
df.head(2)

    Nombre Cereal Favorito
0   Atenea           avena
1  Alberto         fitness

In [100]:
 # los últimos
 df.tail(3)

    Nombre Cereal Favorito
2     Mary           honey
3  Barbara       corn pops
4   Selene        cinnamon

In [101]:
#Para agregar fila y guardar cambio
df = df.append({"Nombre": "Sharoon", "Cereal Favorito": "oreo"}, ignore_index=True)
df

    Nombre Cereal Favorito
0   Atenea           avena
1  Alberto         fitness
2     Mary           honey
3  Barbara       corn pops
4   Selene        cinnamon
5  Sharoon            oreo

In [102]:
#Para agregar columna, agregar serie
df["Hora de desayuno"] = pd.Series(["11:00","11:15","7:00","8:30","9:00","6:45"])
df

    Nombre Cereal Favorito Hora de desayuno
0   Atenea           avena            11:00
1  Alberto         fitness            11:15
2     Mary           honey             7:00
3  Barbara       corn pops             8:30
4   Selene        cinnamon             9:00
5  Sharoon            oreo             6:45

In [103]:
#Para borrar columna
df= df.drop(columns=["Hora de desayuno"])
df

    Nombre Cereal Favorito
0   Atenea           avena
1  Alberto         fitness
2     Mary           honey
3  Barbara       corn pops
4   Selene        cinnamon
5  Sharoon            oreo

In [104]:
#Para borrar índice (fila)
df = df.drop(index=4)
df

    Nombre Cereal Favorito
0   Atenea           avena
1  Alberto         fitness
2     Mary           honey
3  Barbara       corn pops
5  Sharoon            oreo

**Reto 4**
Manipulación de columnas

- Practicar asignar, reasignar y eliminar columnas de `DataFrames`

**a) Transformación de DataFrames**

Esta vez el Analista de Datos te hace 3 nuevos pedidos que incluyen:
1. la creación de una nueva columna, 
2. la asignación de nuevos datos a una columna y
3. la eliminación de un par de columnas. 

Crea un DataFrame usando datos_productos e indice, realiza sus pedidos y envíalos para su verificación

In [ ]:
datos_productos = {
    "nombre": ["Pokemaster", "Cegatron", "Pikame Mucho", "Lazarillo de Tormes", "Stevie Wonder", "Needle", "El AyMeDuele"],
    "precio": [10000, 5500, 3500, 750, 15500, 12250, 23000],
    "peso": [1.2, 1.5, 2.3, 5.5, 3.4, 2.4, 8.8],
    "capacidad de destrucción retinal": [3, 7, 6, 8, 9, 2, 10],
    "disponible": [True, False, True, True, False, False, True]
}

indice = [1, 2, 3, 4, 5, 6, 7]

In [110]:
#0. DataFrame

df_productos = pd.DataFrame(datos_productos, index=indice)
df_productos

                nombre  precio  ...  capacidad de destrucción retinal  disponible
1           Pokemaster   10000  ...                                 3        True
2             Cegatron    5500  ...                                 7       False
3         Pikame Mucho    3500  ...                                 6        True
4  Lazarillo de Tormes     750  ...                                 8        True
5        Stevie Wonder   15500  ...                                 9       False
6               Needle   12250  ...                                 2       False
7         El AyMeDuele   23000  ...                                10        True

[7 rows x 5 columns]

In [111]:
#1. Columna nueva
# Agrega nueva columna a `df_productos_mas_columna_nueva` con el nombre de columna "nivel de dolor"
columna_nueva = [4, 7, 6, 8, 9, 7, 3]
df_productos_mas_columna_nueva = df_productos.copy()
df_productos_mas_columna_nueva["nivel de dolor"] = pd.Series(columna_nueva, index=indice)
df_productos_mas_columna_nueva

                nombre  precio  ...  disponible  nivel de dolor
1           Pokemaster   10000  ...        True               4
2             Cegatron    5500  ...       False               7
3         Pikame Mucho    3500  ...        True               6
4  Lazarillo de Tormes     750  ...        True               8
5        Stevie Wonder   15500  ...       False               9
6               Needle   12250  ...       False               7
7         El AyMeDuele   23000  ...        True               3

[7 rows x 6 columns]

In [ ]:

# Cambia por favor el `DataFrame` `df_productos_descuento` cambiando la columna `precio` por la información contenida en `precios_descuento`
precios_descuento = [8000, 4000, 2000, 500, 14000, 10000, 15000]
df_productos_descuento = df_productos.copy()

# Elimina por favor las columnas "precio" y "peso" de `df_productos` y asigna el resultado a `df_productos_sin_precio_ni_peso`
df_productos_sin_precio_ni_peso =

In [ ]:
# Verificación
def verificar_modificaciones(datos_productos, indice, df_productos, columna_nueva, df_productos_mas_columna_nueva, 
                             precios_descuento, df_productos_descuento, df_productos_sin_precio_ni_peso):
    
    import pandas as pd
    
    df_productos_esperado = pd.DataFrame(datos_productos, index=indice)
    if not df_productos_esperado.equals(df_productos):
        print(f'df_productos ha sido creado incorrectamente ... Favor de revisar')
        return
    
    print(f'== Verificación de Modificaciones ==\n')
    columna_nueva_serie = pd.Series(columna_nueva, index=indice)
    df_productos_mas_columna_nueva_2 = df_productos.copy()
    df_productos_mas_columna_nueva_2['nivel de dolor'] = columna_nueva_serie
    verificar_modificacion(df_productos_mas_columna_nueva_2, df_productos_mas_columna_nueva, 'Agrega por favor columna `columna_nueva` a `df_productos_mas_columna_nueva` con el nombre de columna "nivel de dolor"')
    
    precios_descuento_serie = pd.Series(precios_descuento, index=indice)
    df_productos_descuento_2 = df_productos.copy()
    df_productos_descuento_2['precio'] = precios_descuento_serie
    verificar_modificacion(df_productos_descuento_2, df_productos_descuento, 'Cambia por favor el `DataFrame` `df_productos_descuento` cambiando la columna `precio` por la información contenida en `precios_descuento`')
    
    df_productos_sin_precio_ni_peso_2 = df_productos.drop(columns=['precio', 'peso'])
    verificar_modificacion(df_productos_sin_precio_ni_peso_2, df_productos_sin_precio_ni_peso, 'Elimina por favor las columnas "precio" y "peso"')
    
def verificar_modificacion(esperada, recibida, descripcion):
    es_correcta = "Correcto" if esperada.equals(recibida) else "Incorrecto"
    respuesta = "Muchas gracias!" if es_correcta == "Correcto" else "Favor de revisar"
    print(f"\n- Descripción de pedido: {descripcion}")
    print(f"El pedido es {es_correcta} ... {respuesta}")

**Ejemplo 6**
Lectura JSON

- Aprender a leer archivos JSON y crear `DataFrames` con ellos

**Análisis Exploratorio**

Leer archivo JSON en línea
Zomato Reviews

In [118]:
import json
import requests

#Utilizando pandas
#pd.read_json("LUGAR")

In [121]:
#Utilizando request
data = requests.get('https://raw.githubusercontent.com/beduExpert/Procesamiento-de-Datos-con-Python-Santander/master/Datasets/zomato_reviews-clean.json')
json_data = json.loads(data.content)

df = pd.DataFrame.from_dict(json_data)
df

      has_online_delivery  price_range  ... location.city user_rating.rating_text
0                       1            3  ...     New Delhi               Very Good
1                       0            3  ...     New Delhi               Excellent
2                       1            2  ...     New Delhi               Very Good
3                       0            3  ...     New Delhi               Very Good
4                       0            3  ...     New Delhi               Very Good
...                   ...          ...  ...           ...                     ...
1175                    0            3  ...     Edinburgh               Very Good
1176                    0            3  ...     Edinburgh               Excellent
1177                    0            3  ...     Edinburgh               Excellent
1178                    0            3  ...     Edinburgh                    Good
1179                    0            3  ...     Edinburgh                    Good

[1180 rows x 8 columns]

In [122]:
#Tamaño de data frame
df.shape

(1180, 8)

In [123]:
# Columnas
df.columns

Index(['has_online_delivery', 'price_range', 'currency', 'name', 'cuisines',
       'location.address', 'location.city', 'user_rating.rating_text'],
      dtype='object')

In [124]:
#Tipos de datos
df.info

<bound method DataFrame.info of       has_online_delivery  price_range  ... location.city user_rating.rating_text
0                       1            3  ...     New Delhi               Very Good
1                       0            3  ...     New Delhi               Excellent
2                       1            2  ...     New Delhi               Very Good
3                       0            3  ...     New Delhi               Very Good
4                       0            3  ...     New Delhi               Very Good
...                   ...          ...  ...           ...                     ...
1175                    0            3  ...     Edinburgh               Very Good
1176                    0            3  ...     Edinburgh               Excellent
1177                    0            3  ...     Edinburgh               Excellent
1178                    0            3  ...     Edinburgh                    Good
1179                    0            3  ...     Edinburgh                    Good

[1180 rows x 8 columns]>

In [125]:
df.dtypes

has_online_delivery         int64
price_range                 int64
currency                   object
name                       object
cuisines                   object
location.address           object
location.city              object
user_rating.rating_text    object
dtype: object

**Reto 5**
Análisis exploratorio de datos

Tenemos un conjunto de datos en formato JSON almacenado en '../../Datasets/new_york_times_bestsellers-clean.json' (en la carpeta /Datasets en el directorio raíz del módulo).

In [ ]:
#Qué tipo de preguntas se pueden resolver
#Con datos numéricos: Mayores, menores, top
#Con datos no numéricos: Número de autores con unique
#URL api de Amazon

Preguntas:
Primero que nada, lee el archivo JSON y crea un DataFrame 

Qué tipo de preguntas se pueden resolver
Con datos numéricos: Mayores, menores, top
Con datos no numéricos: Número de autores con unique
URL api de Amazon